## Plan Result (environments/production/codebuild)
- [CI link](https://github.com/jinugasachio/advanced-ecs-on-fargate/actions/runs/1568804596)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.my-bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.my-bucket will be created
  + resource "aws_s3_bucket" "my-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"execute-terraform-plan","PRNumber":71,"Program":"tfcmt","SHA1":"e251dc240368b9dd5729705cf1fdee05bc294697","Target":"environments/production/codebuild","Vars":{},"WorkflowName":"Terraform plan"} -->